bobmittmann/thinkos/sdk/include/stm32f/stm32f-adc.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the libstm32f.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-adc.h
 * @brief
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifndef __STM32F_ADC_H__
#define __STM32F_ADC_H__

/*-------------------------------------------------------------------------
 * Analog-to-digital converter (ADC)
 *-------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------
 * ADC status register */
#define STM32F_ADC_SR 0x00

/* Bits 31:6 Reserved, must be kept cleared. */

#if defined(STM32F2X) || defined(STM32F4X)

/* Bit 5 - Overrun */
#define ADC_OVR (1 << 5)
/* This bit is set by hardware when data are lost (either in single mode 
   or in dual/triple mode). It is cleared by software. Overrun detection is 
   enabled only when DMA = 1 or EOCS = 1.
   0: No overrun occurred
   1: Overrun has occurred */

#endif

/* Bit 4 - Regular channel start flag */
#define ADC_STRT (1 << 4)
/* This bit is set by hardware when regular channel conversion starts. It 
   is cleared by software.
   0: No regular channel conversion started
   1: Regular channel conversion has started */

/* Bit 3 - Injected channel start flag */
#define ADC_JSTRT (1 << 3)
/* This bit is set by hardware when injected group conversion starts. It 
   is cleared by software.
   0: No injected group conversion started
   1: Injected group conversion has started */

/* Bit 2 - Injected channel end of conversion */
#define ADC_JEOC (1 << 2)
/* This bit is set by hardware at the end of the conversion of all 
   injected channels in the group. It is cleared by software.
   0: Conversion is not complete
   1: Conversion complete */

/* Bit 1 - Regular channel end of conversion */
#define ADC_EOC (1 << 1)
/* This bit is set by hardware at the end of the conversion of a regular 
   group of channels. It is cleared by software or by reading the ADC_DR 
   register.
   0: Conversion not complete (EOCS=0), or sequence of conversions not 
   complete (EOCS=1)
   1: Conversion complete (EOCS=0), or sequence of conversions 
   complete (EOCS=1) */

/* Bit 0 - Analog watchdog flag */
#define ADC_AWD (1 << 0)
/* This bit is set by hardware when the converted voltage crosses the values 
   programmed in the ADC_LTR and ADC_HTR registers. It is cleared by software.
   0: No analog watchdog event occurred
   1: Analog watchdog event occurred */


/*-------------------------------------------------------------------------
 * ADC control register 1 */
#define STM32F_ADC_CR1 0x04

#if defined(STM32F2X) || defined(STM32F4X)

/* Bit 26 - Overrun interrupt enable */
#define ADC_OVRIE (1 << 26)
/* This bit is set and cleared by software to enable/disable the Overrun 
   interrupt.
   0: Overrun interrupt disabled
   1: Overrun interrupt enabled. An interrupt is generated when the OVR 
   bit is set. */

/* Bits [25..24] - Resolution */
#define ADC_RES_MSK (((1 << (1 + 1)) - 1) << 24)
#define ADC_RES_12BIT (0 << 24)
#define ADC_RES_10BIT (1 << 24)
#define ADC_RES_8BIT  (2 << 24)
#define ADC_RES_6BIT  (3 << 24)
#define ADC_RES_SET(VAL) (((VAL) << 24) & ADC_RES_MSK)
#define ADC_RES_GET(REG) (((REG) & ADC_RES_MSK) >> 24)
/* These bits are written by software to select the resolution of 
   the conversion.
   00: 12-bit (15 ADCCLK cycles)
   01: 10-bit (13 ADCCLK cycles)
   10: 8-bit (11 ADCCLK cycles)
   11: 6-bit (9 ADCCLK cycles) */
#endif

/* Bit 23 - Analog watchdog enable on regular channels */
#define ADC_AWDEN (1 << 23)
/* This bit is set and cleared by software.
   0: Analog watchdog disabled on regular channels
   1: Analog watchdog enabled on regular channels */

/* Bit 22 - Analog watchdog enable on injected channels */
#define ADC_JAWDEN (1 << 22)
/* This bit is set and cleared by software.
   0: Analog watchdog disabled on injected channels
   1: Analog watchdog enabled on injected channels */

/* Bits 21:16 Reserved, must be kept cleared. */

/* Bits [15..13] - Discontinuous mode channel count */
#define ADC_DISCNUM_MSK (7 << 13)
#define ADC_DISCNUM_SET(VAL) ((((VAL) - 1) << 13) & ADC_DISCNUM_MSK)
#define ADC_DISCNUM_GET(REG) ((((REG) & ADC_DISCNUM_MSK) >> 13) + 1)
/* These bits are written by software to define the number of regular 
   channels to be converted in discontinuous mode, after receiving an 
   external trigger.
   000: 1 channel
   001: 2 channels
   ...
   111: 8 channels */

/* Bit 12 - Discontinuous mode on injected channels */
#define ADC_JDISCEN (1 << 12)
/* This bit is set and cleared by software to enable/disable 
   discontinuous mode on the injected channels of a group.
   0: Discontinuous mode on injected channels disabled
   1: Discontinuous mode on injected channels enabled */

/* Bit 11 - Discontinuous mode on regular channels */
#define ADC_DISCEN (1 << 11)
/* This bit is set and cleared by software to enable/disable Discontinuous 
   mode on regular channels.
   0: Discontinuous mode on regular channels disabled
   1: Discontinuous mode on regular channels enabled */

/* Bit 10 - Automatic injected group conversion */
#define ADC_JAUTO (1 << 10)
/* This bit is set and cleared by software to enable/disable automatic 
   injected group conversion after regular group conversion.
   0: Automatic injected group conversion disabled
   1: Automatic injected group conversion enabled */

/* Bit 9 - Enable the watchdog on a single channel in scan mode */
#define ADC_AWDSGL (1 << 9)
/* This bit is set and cleared by software to enable/disable the analog 
   watchdog on the channel identified by the AWDCH[4:0] bits.
   0: Analog watchdog enabled on all channels
   1: Analog watchdog enabled on a single channel */

