bobmittmann/thinkos/sdk/include/stm32f/stm32f-adc.h
/* Bit 8 - Scan mode */
#define ADC_SCAN (1 << 8)
/* This bit is set and cleared by software to enable/disable the Scan 
   mode. In Scan mode, the inputs selected through the ADC_SQRx or 
   ADC_JSQRx registers are converted.
   0: Scan mode disabled
   1: Scan mode enabled
   Note: An EOC interrupt is generated if the EOCIE bit is set:
   – At the end of each regular group sequence if the EOCS bit is cleared to 0
   – At the end of each regular channel conversion if the EOCS bit is set to 1
   Note: A JEOC interrupt is generated only on the end of conversion of the 
   last channel if the JEOCIE bit is set. */

/* Bit 7 - Interrupt enable for injected channels */
#define ADC_JEOCIE (1 << 7)
/* This bit is set and cleared by software to enable/disable the end of 
   conversion interrupt for injected channels.
   0: JEOC interrupt disabled
   1: JEOC interrupt enabled. An interrupt is generated when the 
   JEOC bit is set. */

/* Bit 6 - Analog watchdog interrupt enable */
#define ADC_AWDIE (1 << 6)
/* This bit is set and cleared by software to enable/disable the 
   analog watchdog interrupt. In Scan mode if the watchdog thresholds are 
   crossed, scan is aborted only if this bit is enabled.
   0: Analog watchdog interrupt disabled
   1: Analog watchdog interrupt enabled */

/* Bit 5 - Interrupt enable for EOC */
#define ADC_EOCIE (1 << 5)
/* This bit is set and cleared by software to enable/disable the end of 
   conversion interrupt.
   0: EOC interrupt disabled
   1: EOC interrupt enabled. An interrupt is generated when the EOC 
   bit is set. */

/* Bits [4..0] - Analog watchdog channel select bits */
#define ADC_AWDCH_MSK (((1 << (4 + 1)) - 1) << 0)
#define ADC_AWDCH_SET(VAL) (((VAL) << 0) & ADC_AWDCH_MSK)
#define ADC_AWDCH_GET(REG) (((REG) & ADC_AWDCH_MSK) >> 0)
/* These bits are set and cleared by software. They select the input 
   channel to be guarded by the analog watchdog.
   Note: 00000: ADC analog input Channel0
   00001: ADC analog input Channel1
   ...
   01111: ADC analog input Channel15
   10000: ADC analog input Channel16
   10001: ADC analog input Channel17
   10010: ADC analog input Channel18
   Other values reserved */


/*-------------------------------------------------------------------------
 * ADC control register 2 */
#define STM32F_ADC_CR2 0x08


#if defined(STM32F1X)


/* Bit 23 - Temperature sensor and VREFINT enable */
#define ADC_TSVREFE (1 << 30)
/* This bit is set and cleared by software to enable/disable the 
   temperature sensor and VREFINT channel.
   0: Temperature sensor and VREFINT channel disabled
   1: Temperature sensor and VREFINT channel enabled */

/* Bit 22 - Start conversion of regular channels */
#define ADC_SWSTART (1 << 22)
/* This bit is set by software to start conversion and cleared by hardware 
   as soon as the conversion starts. It starts a conversion of a group 
   of regular channels if SWSTART is selected as trigger event by 
   the EXTSEL[2:0] bits.
   0: Reset state
   1: Starts conversion of regular channels */


/* Bit 22 - Start conversion of injected channels */
#define ADC_JSWSTART (1 << 21)
/* This bit is set by software and cleared by hardware as soon as the 
   conversion starts.
   0: Reset state
   1: Starts conversion of injected channels
   Note: This bit can be set only when ADON = 1 otherwise no conversion 
   is launched. */


/* Bit 22 - External trigger conversion mode for regular channels */
#define ADC_EXTTRIG (1 << 20)
/* This bit is set and cleared by software to enable/disable the external 
   trigger used to start conversion of a regular channel group.
   0: Conversion on external event disabled
   1: Conversion on external event enabled */

/* Bits [19..17] - External event select for regular group */
#define ADC_EXTSEL_MSK (((1 << (3)) - 1) << 17)
#define ADC_EXTSEL_SET(VAL) (((VAL) << 17) & ADC_EXTSEL_MSK)
#define ADC_EXTSEL_GET(REG) (((REG) & ADC_EXTSEL_MSK) >> 17)

#define ADC_EXTSEL_TIM1_CC1  (0x0 << 17)
#define ADC_EXTSEL_TIM1_CC2  (0x1 << 17)
#define ADC_EXTSEL_TIM1_CC3  (0x2 << 17)
#define ADC_EXTSEL_TIM2_CC2  (0x3 << 17)
#define ADC_EXTSEL_TIM3_TRGO (0x4 << 17)
#define ADC_EXTSEL_TIM4_CC4  (0x5 << 17)
#define ADC_EXTSEL_EXTI      (0x6 << 17)
#define ADC_EXTSEL_SWSTART   (0x7 << 17)

/* These bits select the external event used to trigger the start of 
   conversion of a regular group:
   000: Timer 1 CC1 event
   001: Timer 1 CC2 event
   010: Timer 1 CC3 event
   011: Timer 2 CC2 event
   100: Timer 3 TRGO event
   101: Timer 4 CC4 event
   110: EXTI line11
   111: SWSTART */



/* Bit 22 - External trigger conversion mode for injected channels */
#define ADC_JEXTTRIG (1 << 15)
/* This bit is set and cleared by software to enable/disable the 
   external trigger used to start conversion of an injected channel group.
   0: Conversion on external event disabled
   1: Conversion on external event enabled */


/* Bits [14..12] - External event select for injected group */
#define ADC_JEXTSEL_MSK (((1 << 3) - 1) << 12)
#define ADC_JEXTSEL_SET(VAL) (((VAL) << 12) & ADC_JEXTSEL_MSK)
#define ADC_JEXTSEL_GET(REG) (((REG) & ADC_JEXTSEL_MSK) >> 12)
/* These bits select the external event used to trigger the start of 
   conversion of an injected group.
   000: Timer 1 TRGO event
   001: Timer 1 CC4 event
   010: Timer 2 TRGO event
   011: Timer 2 CC1 event
   100: Timer 3 CC4 event
   101: Timer 4 TRGO event
   110: EXTI line15 
   111: JSWSTART */

#elif defined(STM32F2X) || defined(STM32F4X)

/* Bit 30 - Start conversion of regular channels */
#define ADC_SWSTART (1 << 30)
/* This bit is set by software to start conversion and cleared by hardware 
   as soon as the conversion starts.
   0: Reset state
   1: Starts conversion of regular channels
   Note: This bit can be set only when ADON = 1 otherwise no conversion 
   is launched. */

/* Bits [29..28] - External trigger enable for regular channels */
#define ADC_EXTEN ((29 - 28) << 28)
#define ADC_EXTEN_RISING (1 << 28)
#define ADC_EXTEN_FALLING (2 << 28)
#define ADC_EXTEN_BOTH (3 << 28)
/* These bits are set and cleared by software to select the external 
   trigger polarity and enable the trigger of a regular group.
   00: Trigger detection disabled
   01: Trigger detection on the rising edge
   10: Trigger detection on the falling edge
   11: Trigger detection on both the rising and falling edges */

/* Bits [27..24] - External event select for regular group */
#define ADC_EXTSEL_MSK (((1 << (4)) - 1) << 24)
#define ADC_EXTSEL_SET(VAL) (((VAL) << 24) & ADC_EXTSEL_MSK)
#define ADC_EXTSEL_GET(REG) (((REG) & ADC_EXTSEL_MSK) >> 24)
#define ADC_EXTSEL_TIM1_CC1  (0x0 << 24)
#define ADC_EXTSEL_TIM1_CC2  (0x1 << 24)
#define ADC_EXTSEL_TIM1_CC3  (0x2 << 24)
#define ADC_EXTSEL_TIM2_CC2  (0x3 << 24)
#define ADC_EXTSEL_TIM2_CC3  (0x4 << 24)
#define ADC_EXTSEL_TIM2_CC4  (0x5 << 24)
#define ADC_EXTSEL_TIM2_TRGO (0x6 << 24)
#define ADC_EXTSEL_TIM3_CC1  (0x7 << 24)
#define ADC_EXTSEL_TIM3_TRGO (0x8 << 24)
#define ADC_EXTSEL_TIM4_CC4  (0x9 << 24)
#define ADC_EXTSEL_TIM5_CC1  (0xa << 24)
#define ADC_EXTSEL_TIM5_CC2  (0xb << 24)
#define ADC_EXTSEL_TIM5_CC3  (0xc << 24)
#define ADC_EXTSEL_TIM8_CC1  (0xd << 24)
#define ADC_EXTSEL_TIM8_TRGO (0xe << 24)
#define ADC_EXTSEL_EXTI      (0xf << 24)
/* These bits select the external event used to trigger the start of 
   conversion of a regular group:
   0000: Timer 1 CC1 event
   0001: Timer 1 CC2 event
   0010: Timer 1 CC3 event
   0011: Timer 2 CC2 event
   0100: Timer 2 CC3 event
   0101: Timer 2 CC4 event
   0110: Timer 2 TRGO event
   0111: Timer 3 CC1 event
   1000: Timer 3 TRGO event
   1001: Timer 4 CC4 event
   1010: Timer 5 CC1 event
   1011: Timer 5 CC2 event
   1100: Timer 5 CC3 event
   1101: Timer 8 CC1 event
   1110: Timer 8 TRGO event
   1111: EXTI line11 */

/* Bit 23 Reserved, must be kept cleared. */

/* Bit 22 - Start conversion of injected channels */
#define ADC_JSWSTART (1 << 22)
/* This bit is set by software and cleared by hardware as soon as the 
   conversion starts.
   0: Reset state
   1: Starts conversion of injected channels
   Note: This bit can be set only when ADON = 1 otherwise no conversion 
   is launched. */

/* Bits [21..20] - External trigger enable for injected channels */
#define ADC_JEXTEN ((21 - 20) << 20)
/* These bits are set and cleared by software to select the external trigger 
   polarity and enable the trigger of an injected group.
   00: Trigger detection disabled
   01: Trigger detection on the rising edge
   10: Trigger detection on the falling edge
   11: Trigger detection on both the rising and falling edges */


/* Bits [19..16] - External event select for injected group */
#define ADC_JEXTSEL_MSK (((1 << 4) - 1) << 16)
#define ADC_JEXTSEL_SET(VAL) (((VAL) << 16) & ADC_JEXTSEL_MSK)
#define ADC_JEXTSEL_GET(REG) (((REG) & ADC_JEXTSEL_MSK) >> 16)
/* These bits select the external event used to trigger the start of 
   conversion of an injected group.
   0000: Timer 1 CC4 event
   0001: Timer 1 TRGO event
   0010: Timer 2 CC1 event
   0011: Timer 2 TRGO event
   0100: Timer 3 CC2 event
   0101: Timer 3 CC4 event
   0110: Timer 4 CC1 event
   0111: Timer 4 CC2 event
   1000: Timer 4 CC3 event
   1001: Timer 4 TRGO event
   1010: Timer 5 CC4 event
   1011: Timer 5 TRGO event
   1100: Timer 8 CC2 event
   1101: Timer 8 CC3 event
   1110: Timer 8 CC4 event
   1111: EXTI line15 */

#endif

/* Bit 11 - Data alignment */
#define ADC_ALIGN (1 << 11)
/* This bit is set and cleared by software. 
   Refer to Figure 32 and Figure 33.
   0: Right alignment
   1: Left alignment */

#if defined(STM32F2X) || defined(STM32F4X)

/* Bit 10 - End of conversion selection */
#define ADC_EOCS (1 << 10)
/* This bit is set and cleared by software.
   0: The EOC bit is set at the end of each sequence of regular 
   conversions. Overrun detection is enabled only if DMA=1.
   1: The EOC bit is set at the end of each regular conversion. Overrun 
   detection is enabled. */

/* Bit 9 - DMA disable selection (for single ADC mode) */
#define ADC_DDS (1 << 9)
/* This bit is set and cleared by software.
   0: No new DMA request is issued after the last transfer (as configured 
   in the DMA controller)
   1: DMA requests are issued as long as data are converted and DMA=1 */

#endif

/* Bit 8 - Direct memory access mode (for single ADC mode) */
#define ADC_DMA (1 << 8)
/* This bit is set and cleared by software. Refer to the DMA controller 
   chapter for more details.
   0: DMA mode disabled
   1: DMA mode enabled */

/* Bits 7:2 Reserved, must be kept cleared. */

#if defined(STM32F1X)

/* Bit 3 - Reset calibration */
#define ADC_RSTCAL (1 << 3)
/* This bit is set by software and cleared by hardware. It is cleared after 
   the calibration registers are initialized.
   0: Calibration register initialized.
   1: Initialize calibration register.
   Note: If RSTCAL is set when conversion is ongoing, additional cycles 
   are required to clear the calibration registers. */

/* Bit 2 - A/D Calibration */
#define ADC_CAL (1 << 2)
/* This bit is set by software to start the calibration. It is reset 
   by hardware after calibration is complete.
   0: Calibration completed
   1: Enable calibration */

#endif


