bobmittmann/thinkos/sdk/include/stm32f/stm32f-adc.h
/* Bit 1 - Continuous conversion */
#define ADC_CONT (1 << 1)
/* This bit is set and cleared by software. If it is set, conversion 
   takes place continuously until it is cleared.
   0: Single conversion mode
   1: Continuous conversion mode */

/* Bit 0 - A/D Converter ON / OFF */
#define ADC_ADON (1 << 0)
/* This bit is set and cleared by software.
   0: Disable ADC conversion and go to power down mode
   1: Enable ADC */


/*-------------------------------------------------------------------------
 * ADC sample time register 1 */
#define STM32F_ADC_SMPR1 0x0C
/* Bits [26..0] - Channel x sampling time selection */

/*-------------------------------------------------------------------------
 * ADC sample time register 2 */
#define STM32F_ADC_SMPR2 0x10
/* Bits [29..0] - Channel x sampling time selection */

#define ADC_SMP_MSK(X) (0x7 << (3 * (X)))
#define ADC_SMP_SET(X, VAL) (((VAL) << (3 * (X))) & ADC_SMP_MSK(X))
#define ADC_SMP_GET(X, REG) (((REG) & ADC_SMP_MSK(X)) >> (3 * (X)))
/* These bits are written by software to select the sampling time 
   individually for each channel. During sampling cycles, the channel 
   selection bits must remain unchanged.
   Note: 000: 3 cycles
   001: 15 cycles
   010: 28 cycles
   011: 56 cycles
   100: 84 cycles
   101: 112 cycles
   110: 144 cycles
   111: 480 cycles */

#if defined(STM32F1X)

#define ADC_SMP_1_CYC   0
#define ADC_SMP_7_CYC   1
#define ADC_SMP_13_CYC  2
#define ADC_SMP_28_CYC  3
#define ADC_SMP_41_CYC  4
#define ADC_SMP_56_CYC  5
#define ADC_SMP_71_CYC  6
#define ADC_SMP_239_CYC 7

#elif defined(STM32F2X) || defined(STM32F4X)

#define ADC_SMP_3_CYC   0
#define ADC_SMP_15_CYC  1
#define ADC_SMP_28_CYC  2
#define ADC_SMP_56_CYC  3
#define ADC_SMP_84_CYC  4
#define ADC_SMP_112_CYC 5
#define ADC_SMP_144_CYC 6
#define ADC_SMP_480_CYC 7

#endif

/*-------------------------------------------------------------------------
 * ADC injected channel data offset register x */
#define STM32F_ADC_JOFR1 0x14
#define STM32F_ADC_JOFR2 0x18
#define STM32F_ADC_JOFR3 0x1c
#define STM32F_ADC_JOFR4 0x20


/* Bits [11..0] - Data offset for injected channel x */
#define ADC_JOFFSETX_MSK (((1 << (11 + 1)) - 1) << 0)
#define ADC_JOFFSETX_SET(VAL) (((VAL) << 0) & ADC_JOFFSETX_MSK)
#define ADC_JOFFSETX_GET(REG) (((REG) & ADC_JOFFSETX_MSK) >> 0)
/* These bits are written by software to define the offset to be subtracted from the raw
converted data when converting injected channels. The conversion result can be read from
in the ADC_JDRx registers. */


/*-------------------------------------------------------------------------
 * ADC watchdog higher threshold register */
#define STM32F_ADC_HTR 0x24


/* Bits [11..0] - Analog watchdog higher threshold */
#define ADC_HT_MSK (((1 << (11 + 1)) - 1) << 0)
#define ADC_HT_SET(VAL) (((VAL) << 0) & ADC_HT_MSK)
#define ADC_HT_GET(REG) (((REG) & ADC_HT_MSK) >> 0)
/* These bits are written by software to define the higher threshold for the analog watchdog.
 */

/*-------------------------------------------------------------------------
 * ADC watchdog lower threshold register */
#define STM32F_ADC_LTR 0x28


/* Bits [11..0] - Analog watchdog lower threshold */
#define ADC_LT_MSK (((1 << (11 + 1)) - 1) << 0)
#define ADC_LT_SET(VAL) (((VAL) << 0) & ADC_LT_MSK)
#define ADC_LT_GET(REG) (((REG) & ADC_LT_MSK) >> 0)
/* These bits are written by software to define the lower threshold for the analog watchdog. */


/*-------------------------------------------------------------------------
 * ADC regular sequence register 1 */
#define STM32F_ADC_SQR1 0x2C


/* Bits [23..20] - Regular channel sequence length */
#define ADC_L_MSK (((1 << (4)) - 1) << 20)
#define ADC_L_SET(VAL) ((((VAL) - 1) << 20) & ADC_L_MSK)
#define ADC_L_GET(REG) ((((REG) & ADC_L_MSK) >> 20) + 1)
/* These bits are written by software to define the total number of 
   conversions in the regular channel conversion sequence.
   0000: 1 conversion
   0001: 2 conversions
   ...
   1111: 16 conversions */

/* Bits [19..15] - 16th conversion in regular sequence */
#define ADC_SQ16_MSK (((1 << (4 + 1)) - 1) << 15)
#define ADC_SQ16_SET(VAL) (((VAL) << 15) & ADC_SQ16_MSK)
#define ADC_SQ16_GET(REG) (((REG) & ADC_SQ16_MSK) >> 15)
/* These bits are written by software with the channel number (0..18) 
   assigned as the 16th in the conversion sequence. */

/* Bits [14..10] 15th conversion in regular sequence */
#define ADC_SQ15_MSK (((1 << (4 + 1)) - 1) << 10)
#define ADC_SQ15_SET(VAL) (((VAL) << 10) & ADC_SQ15_MSK)
#define ADC_SQ15_GET(REG) (((REG) & ADC_SQ15_MSK) >> 10)

/* Bits [9..5] - 14th conversion in regular sequence */
#define ADC_SQ14_MSK (((1 << (4 + 1)) - 1) << 5)
#define ADC_SQ14_SET(VAL) (((VAL) << 5) & ADC_SQ14_MSK)
#define ADC_SQ14_GET(REG) (((REG) & ADC_SQ14_MSK) >> 5)

/* Bits [4..0] - 13th conversion in regular sequence */
#define ADC_SQ13_MSK (((1 << (4 + 1)) - 1) << 0)
#define ADC_SQ13_SET(VAL) (((VAL) << 0) & ADC_SQ13_MSK)
#define ADC_SQ13_GET(REG) (((REG) & ADC_SQ13_MSK) >> 0)


/*-------------------------------------------------------------------------
 * ADC regular sequence register 2 */
#define STM32F_ADC_SQR2 0x30


/* Bits [29..26] - 12th conversion in regular sequence */
#define ADC_SQ12_MSK (((1 << (4 + 1)) - 1) << 26)
#define ADC_SQ12_SET(VAL) (((VAL) << 26) & ADC_SQ12_MSK)
#define ADC_SQ12_GET(REG) (((REG) & ADC_SQ12_MSK) >> 26)
/* These bits are written by software with the channel number (0..18) 
   assigned as the 12th in the sequence to be converted. */

/* Bits [24..20] - 11th conversion in regular sequence */
#define ADC_SQ11_MSK (((1 << (4 + 1)) - 1) << 20)
#define ADC_SQ11_SET(VAL) (((VAL) << 20) & ADC_SQ11_MSK)
#define ADC_SQ11_GET(REG) (((REG) & ADC_SQ11_MSK) >> 20)

/* Bits [19..15] - 10th conversion in regular sequence */
#define ADC_SQ10_MSK (((1 << (4 + 1)) - 1) << 15)
#define ADC_SQ10_SET(VAL) (((VAL) << 15) & ADC_SQ10_MSK)
#define ADC_SQ10_GET(REG) (((REG) & ADC_SQ10_MSK) >> 15)

/* Bits [14..10] - 9th conversion in regular sequence */
#define ADC_SQ9_MSK (((1 << (4 + 1)) - 1) << 10)
#define ADC_SQ9_SET(VAL) (((VAL) << 10) & ADC_SQ9_MSK)
#define ADC_SQ9_GET(REG) (((REG) & ADC_SQ9_MSK) >> 10)

/* Bits [9..5] - 8th conversion in regular sequence */
#define ADC_SQ8_MSK (((1 << (4 + 1)) - 1) << 5)
#define ADC_SQ8_SET(VAL) (((VAL) << 5) & ADC_SQ8_MSK)
#define ADC_SQ8_GET(REG) (((REG) & ADC_SQ8_MSK) >> 5)

/* Bits [4..0] - 7th conversion in regular sequence */
#define ADC_SQ7_MSK (((1 << (4 + 1)) - 1) << 0)
#define ADC_SQ7_SET(VAL) (((VAL) << 0) & ADC_SQ7_MSK)
#define ADC_SQ7_GET(REG) (((REG) & ADC_SQ7_MSK) >> 0)


/*-------------------------------------------------------------------------
 * ADC regular sequence register 3 */
#define STM32F_ADC_SQR3 0x34


/* Bits [29..25] - 6th conversion in regular sequence */
#define ADC_SQ6_MSK (((1 << (4 + 1)) - 1) << 25)
#define ADC_SQ6_SET(VAL) (((VAL) << 25) & ADC_SQ6_MSK)
#define ADC_SQ6_GET(REG) (((REG) & ADC_SQ6_MSK) >> 25)
/* These bits are written by software with the channel number (0..18) 
   assigned as the 6th in the sequence to be converted. */

/* Bits [24..20] - 5th conversion in regular sequence */
#define ADC_SQ5_MSK (((1 << (4 + 1)) - 1) << 20)
#define ADC_SQ5_SET(VAL) (((VAL) << 20) & ADC_SQ5_MSK)
#define ADC_SQ5_GET(REG) (((REG) & ADC_SQ5_MSK) >> 20)

/* Bits [19..15] - 4th conversion in regular sequence */
#define ADC_SQ4_MSK (((1 << (4 + 1)) - 1) << 15)
#define ADC_SQ4_SET(VAL) (((VAL) << 15) & ADC_SQ4_MSK)
#define ADC_SQ4_GET(REG) (((REG) & ADC_SQ4_MSK) >> 15)

/* Bits [14..10] - 3rd conversion in regular sequence */
#define ADC_SQ3_MSK (((1 << (4 + 1)) - 1) << 10)
#define ADC_SQ3_SET(VAL) (((VAL) << 10) & ADC_SQ3_MSK)
#define ADC_SQ3_GET(REG) (((REG) & ADC_SQ3_MSK) >> 10)

