bobmittmann/thinkos/sdk/include/stm32f/stm32f-adc.h
/* Bits [9..5] - 2nd conversion in regular sequence */
#define ADC_SQ2_MSK (((1 << (4 + 1)) - 1) << 5)
#define ADC_SQ2_SET(VAL) (((VAL) << 5) & ADC_SQ2_MSK)
#define ADC_SQ2_GET(REG) (((REG) & ADC_SQ2_MSK) >> 5)

/* Bits [4..0] - 1st conversion in regular sequence */
#define ADC_SQ1_MSK (((1 << (4 + 1)) - 1) << 0)
#define ADC_SQ1_SET(VAL) (((VAL) << 0) & ADC_SQ1_MSK)
#define ADC_SQ1_GET(REG) (((REG) & ADC_SQ1_MSK) >> 0)


/*-------------------------------------------------------------------------
 * ADC injected sequence register */
#define STM32F_ADC_JSQR 0x38


/* Bits [21..20] - Injected sequence length */
#define ADC_JL_MSK (((1 << (1 + 1)) - 1) << 20)
#define ADC_JL_SET(VAL) (((VAL) << 20) & ADC_JL_MSK)
#define ADC_JL_GET(REG) (((REG) & ADC_JL_MSK) >> 20)
/* These bits are written by software to define the total number of conversions in the injected
channel conversion sequence.
00: 1 conversion
01: 2 conversions
10: 3 conversions
11: 4 conversions */

/* Bits [19..15] - 4th conversion in injected sequence (when JL[1:0]=3, see note below) */
#define ADC_JSQ4_MSK (((1 << (4 + 1)) - 1) << 15)
#define ADC_JSQ4_SET(VAL) (((VAL) << 15) & ADC_JSQ4_MSK)
#define ADC_JSQ4_GET(REG) (((REG) & ADC_JSQ4_MSK) >> 15)
/* These bits are written by software with the channel number (0..18) assigned as the 4th in the
sequence to be converted. */

/* Bits [14..10] - 3rd conversion in injected sequence (when JL[1:0]=3, see note below) */
#define ADC_JSQ3_MSK (((1 << (4 + 1)) - 1) << 10)
#define ADC_JSQ3_SET(VAL) (((VAL) << 10) & ADC_JSQ3_MSK)
#define ADC_JSQ3_GET(REG) (((REG) & ADC_JSQ3_MSK) >> 10)

/* Bits [9..5] - 2nd conversion in injected sequence (when JL[1:0]=3, see note below) */
#define ADC_JSQ2_MSK (((1 << (4 + 1)) - 1) << 5)
#define ADC_JSQ2_SET(VAL) (((VAL) << 5) & ADC_JSQ2_MSK)
#define ADC_JSQ2_GET(REG) (((REG) & ADC_JSQ2_MSK) >> 5)

/* Bits [4..0] - 1st conversion in injected sequence (when JL[1:0]=3, see note below) */
#define ADC_JSQ1_MSK (((1 << (4 + 1)) - 1) << 0)
#define ADC_JSQ1_SET(VAL) (((VAL) << 0) & ADC_JSQ1_MSK)
#define ADC_JSQ1_GET(REG) (((REG) & ADC_JSQ1_MSK) >> 0)
/* Note:
When JL[1:0]=3 (4 injected conversions in the sequencer), the ADC converts the channels
in the following order: JSQ1[4:0], JSQ2[4:0], JSQ3[4:0], and JSQ4[4:0].
When JL=2 (3 injected conversions in the sequencer), the ADC converts the channels in the
following order: JSQ2[4:0], JSQ3[4:0], and JSQ4[4:0].
When JL=1 (2 injected conversions in the sequencer), the ADC converts the channels in
starting from JSQ3[4:0], and then JSQ4[4:0].
When JL=0 (1 injected conversion in the sequencer), the ADC converts only JSQ4[4:0]
channel. */


/*-------------------------------------------------------------------------
 * ADC injected data register x */
#define STM32F_ADC_JDRX 0x3C


/* Bits [15..0] - Injected data */
#define ADC_JDATA_MSK (((1 << (15 + 1)) - 1) << 0)
#define ADC_JDATA_SET(VAL) (((VAL) << 0) & ADC_JDATA_MSK)
#define ADC_JDATA_GET(REG) (((REG) & ADC_JDATA_MSK) >> 0)
/* These bits are read-only. They contain the conversion result from 
   injected channel x. The data are left -or right-aligned as shown 
   in Figure 32 and Figure 33. */


/*-------------------------------------------------------------------------
 * ADC regular data register */
#define STM32F_ADC_DR 0x4C


/* Bits [15..0] - Regular data */
#define ADC_DATA_MSK (((1 << (15 + 1)) - 1) << 0)
#define ADC_DATA_SET(VAL) (((VAL) << 0) & ADC_DATA_MSK)
#define ADC_DATA_GET(REG) (((REG) & ADC_DATA_MSK) >> 0)
/* These bits are read-only. They contain the conversion result from 
   the regular channels. The data are left- or right-aligned as shown 
   in Figure 32 and Figure 33. */


#if defined(STM32F2X) || defined(STM32F4X)

/*-------------------------------------------------------------------------
 * ADC Common status register */
#define STM32F_ADC_CSR 0x00
/* This register provides an image of the status bits of the different ADCs. 
   Nevertheless it is read-only and does not allow to clear the different 
   status bits. Instead each status bit must be cleared by writing it to 0 
   in the corresponding ADC_SR register. */

/* Bit 21 - Overrun flag of ADC3 */
#define ADC_OVR3 (1 << 21)
/* This bit is a copy of the OVR bit in the ADC3_SR register. */

/* Bit 20 - Regular channel Start flag of ADC3 */
#define ADC_STRT3 (1 << 20)
/* This bit is a copy of the STRT bit in the ADC3_SR register. */

/* Bit 19 - Injected channel Start flag of ADC3 */
#define ADC_JSTRT3 (1 << 19)
/* This bit is a copy of the JSTRT bit in the ADC3_SR register. */

/* Bit 18 - Injected channel end of conversion of ADC3 */
#define ADC_JEOC3 (1 << 18)
/* This bit is a copy of the JEOC bit in the ADC3_SR register. */

/* Bit 17 - End of conversion of ADC3 */
#define ADC_EOC3 (1 << 17)
/* This bit is a copy of the EOC bit in the ADC3_SR register. */

/* Bit 16 - Analog watchdog flag of ADC3 */
#define ADC_AWD3 (1 << 16)
/* This bit is a copy of the AWD bit in the ADC3_SR register. */

/* Bits 15:14 Reserved, must be kept cleared. */

/* Bit 13 - Overrun flag of ADC2 */
#define ADC_OVR2 (1 << 13)
/* This bit is a copy of the OVR bit in the ADC2_SR register. */

/* Bit 12 - Regular channel Start flag of ADC2 */
#define ADC_STRT2 (1 << 12)
/* This bit is a copy of the STRT bit in the ADC2_SR register. */

/* Bit 11 - Injected channel Start flag of ADC2 */
#define ADC_JSTRT2 (1 << 11)
/* This bit is a copy of the JSTRT bit in the ADC2_SR register. */

/* Bit 10 - Injected channel end of conversion of ADC2 */
#define ADC_JEOC2 (1 << 10)
/* This bit is a copy of the JEOC bit in the ADC2_SR register. */

/* Bit 9 - End of conversion of ADC2 */
#define ADC_EOC2 (1 << 9)
/* This bit is a copy of the EOC bit in the ADC2_SR register. */

/* Bit 8 - Analog watchdog flag of ADC2 */
#define ADC_AWD2 (1 << 8)
/* This bit is a copy of the AWD bit in the ADC2_SR register. */

/* Bits 7:6 Reserved, must be kept cleared. */

/* Bit 5 - Overrun flag of ADC1 */
#define ADC_OVR1 (1 << 5)
/* This bit is a copy of the OVR bit in the ADC1_SR register. */

/* Bit 4 - Regular channel Start flag of ADC1 */
#define ADC_STRT1 (1 << 4)
/* This bit is a copy of the STRT bit in the ADC1_SR register. */

/* Bit 3 - Injected channel Start flag of ADC1 */
#define ADC_JSTRT1 (1 << 3)
/* This bit is a copy of the JSTRT bit in the ADC1_SR register. */

/* Bit 2 - Injected channel end of conversion of ADC1 */
#define ADC_JEOC1 (1 << 2)
/* This bit is a copy of the JEOC bit in the ADC1_SR register. */

/* Bit 1 - End of conversion of ADC1 */
#define ADC_EOC1 (1 << 1)
/* This bit is a copy of the EOC bit in the ADC1_SR register. */

/* Bit 0 - Analog watchdog flag of ADC1 */
#define ADC_AWD1 (1 << 0)
/* This bit is a copy of the AWD bit in the ADC1_SR register. */

/*-------------------------------------------------------------------------
 * ADC common control register */
#define STM32F_ADC_CCR 0x04

