bobmittmann/thinkos/sdk/include/stm32f/stm32f-adc.h
/* Bit 23 - Temperature sensor and VREFINT enable */
#define ADC_TSVREFE (1 << 23)
/* This bit is set and cleared by software to enable/disable the 
   temperature sensor and the VREFINT channel.
   0: Temperature sensor and VREFINT channel disabled
   1: Temperature sensor and VREFINT channel enabled */

/* Bit 22 - VBAT enable */
#define ADC_VBATE (1 << 22)
/* This bit is set and cleared by software to enable/disable the VBAT channel.
   0: VBAT channel disabled
   1: VBAT channel enabled */

/* Bits 21:18 Reserved, must be kept cleared. */

/* Bits [17..16] - ADC prescaler */
#define ADC_ADCPRE ((17 - 16) << 16)
#define ADC_ADCPRE_2 (0 << 16)
#define ADC_ADCPRE_4 (1 << 16)
#define ADC_ADCPRE_6 (2 << 16)
#define ADC_ADCPRE_8 (3 << 16)
/* Set and cleared by software to select the frequency of the clock 
   to the ADC. The clock is common for all the ADCs.
   Note: 00: PCLK2 divided by 2
   01: PCLK2 divided by 4
   10: PCLK2 divided by 6
   11: PCLK2 divided by 8 */

/* Bits [15..14] - Direct memory access mode for multi ADC mode */
#define ADCC_DMA ((15 - 14) << 14)
//#define ADC_DMA ((15 - 14) << 14)
/* This bit-field is set and cleared by software. Refer to the DMA 
   controller section for more details.
   00: DMA mode disabled
   01: DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)
   10: DMA mode 2 enabled (2 / 3 half-words by pairs - 2&1 then 1&3 then 3&2)
   11: DMA mode 3 enabled (2 / 3 bytes by pairs - 2&1 then 1&3 then 3&2) */

/* Bit 13 - DMA disable selection (for multi-ADC mode) */
#define ADCC_DDS (1 << 13)
/* This bit is set and cleared by software.
   0: No new DMA request is issued after the last transfer (as configured 
   in the DMA controller).
   DMA bits are not cleared by hardware, however they must have been 
   cleared and set to the wanted mode by software before new DMA requests 
   can be generated.
   1: DMA requests are issued as long as data are converted 
   and DMA = 01, 10 or 11. */

/* Bit 12 Reserved, must be kept cleared. */

/* Bits [11..8] - Delay between 2 sampling phases */
#define ADC_DELAY ((11 - 8) << 8)
/* Set and cleared by software. These bits are used in dual or triple 
   interleaved modes.
   0000: 5 * TADCCLK
   0001: 6 * TADCCLK
   0010: 7 * TADCCLK
   ...
   1111: 20 * TADCCLK */

/* Bits 7:5 Reserved, must be kept cleared. */

/* Bits [4..0] - Multi ADC mode selection */
#define ADC_MULTI_MSK (((1 << (4 + 1)) - 1) << 0)
#define ADC_MULTI_SET(VAL) (((VAL) << 0) & ADC_MULTI_MSK)
#define ADC_MULTI_GET(REG) (((REG) & ADC_MULTI_MSK) >> 0)
/* These bits are written by software to select the operating mode.
   – All the ADCs independent:
   00000: Independent mode
   – 00001 to 01001: Dual mode, ADC1 and ADC2 working together, 
   ADC3 is independent
   00001: Combined regular simultaneous + injected simultaneous mode
   00010: Combined regular simultaneous + alternate trigger mode
   00011: Reserved
   00101: Injected simultaneous mode only
   00110: Regular simultaneous mode only
   00111: interleaved mode only
   01001: Alternate trigger mode only
   – 10001 to 11001: Triple mode: ADC1, 2 and 3 working together
   10001: Combined regular simultaneous + injected simultaneous mode
   10010: Combined regular simultaneous + alternate trigger mode
   10011: Reserved
   10101: Injected simultaneous mode only
   10110: Regular simultaneous mode only
   10111: interleaved mode only
   11001: Alternate trigger mode only
   All other combinations are reserved and must not be programmed
   Note: In multi mode, a change of channel configuration generates an 
   abort that can cause a loss of synchronization. It is recommended to 
   disable the multi ADC mode before any configuration change. */


/*-------------------------------------------------------------------------
 * ADC common regular data register for dual and triple modes */
#define STM32F_ADC_CDR 0x08 
/* this offset address is relative to ADC1 base address + 0x300 */

/* Bits [31..16] - 2nd data item of a pair of regular conversions */
#define ADC_DATA2_MSK (((1 << (15 + 1)) - 1) << 16)
#define ADC_DATA2_SET(VAL) (((VAL) << 16) & ADC_DATA2_MSK)
#define ADC_DATA2_GET(REG) (((REG) & ADC_DATA2_MSK) >> 16)
/* – In dual mode, these bits contain the regular data of ADC2. Refer to 
   Dual ADC mode.
   – In triple mode, these bits contain alternatively the regular data of 
   ADC2, ADC1 and ADC3.
   Refer to Triple ADC mode. */

/* Bits [15..0] - 1st data item of a pair of regular conversions */
#define ADC_DATA1_MSK (((1 << (15 + 1)) - 1) << 0)
#define ADC_DATA1_SET(VAL) (((VAL) << 0) & ADC_DATA1_MSK)
#define ADC_DATA1_GET(REG) (((REG) & ADC_DATA1_MSK) >> 0)
/* – In dual mode, these bits contain the regular data of ADC1. Refer to 
   Dual ADC mode
   – In triple mode, these bits contain alternatively the regular data of 
   ADC1, ADC3 and ADC2. 
   Refer to Triple ADC mode. */

#endif /* STM32F2X */

#ifndef __ASSEMBLER__

#include <stdint.h>

struct stm32f_adc {
	volatile uint32_t sr;
	volatile uint32_t cr1;
	volatile uint32_t cr2;
	volatile uint32_t smpr1;

	volatile uint32_t smpr2;
	volatile uint32_t jofr1;
	volatile uint32_t jofr2;
	volatile uint32_t jofr3;

	volatile uint32_t jofr4;
	volatile uint32_t htr;
	volatile uint32_t ltr;
	volatile uint32_t sqr1;

	volatile uint32_t sqr2;
	volatile uint32_t sqr3;
	volatile uint32_t jsqr;
	volatile uint32_t jsdr1;

	volatile uint32_t jsdr2;
	volatile uint32_t jsdr3;
	volatile uint32_t jsdr4;
	volatile uint32_t dr;
};

#if defined(STM32F2X) || defined(STM32F4X)
struct stm32f_adcc {
	volatile uint32_t csr;
	volatile uint32_t ccr;
	volatile uint32_t cdr;
};
#endif

/* set the sample time for an specific ADC channel */
static inline void stm32f_adc_smp_set(struct stm32f_adc * adc, 
									   unsigned int chan, unsigned int val) {
	uint32_t smpr;
	
	if (chan > 9) {
		smpr = adc->smpr1 & ~ADC_SMP_MSK(chan - 10);
		adc->smpr1 = smpr | ADC_SMP_SET(chan - 10, val);
	} else {
		smpr = adc->smpr2 & ~ADC_SMP_MSK(chan);
		adc->smpr2 = smpr | ADC_SMP_SET(chan, val);
	}
}

/* set the conversion channel sequence */
static inline void stm32f_adc_seq_set(struct stm32f_adc * adc, 
									  const uint8_t * chan, unsigned int len) {
	uint32_t sqr1;
	uint32_t sqr2;
	uint32_t sqr3;
	unsigned int n;
	unsigned int i;

	sqr1 = ADC_L_SET(len);
	sqr2 = 0;
	sqr3 = 0;

	/* First 6 channels */
	n = (len > 6) ? 6 : len;
	for (i = 0; i < n; i++)
		sqr3 |= chan[i] << (5 * i);

	/* Channels 7 to 12 */
	len -= n;
	n = (len > 6) ? 6 : len;
	for (i = 0; i < len; i++)
		sqr2 |= chan[i + 6] << (5 * i);

	/* Channels 13 to 16 */
	len -= n;
	n = (len > 4) ? 4 : len;
	for (i = 0; i < len; i++)
		sqr1 |= chan[i + 12] << (5 * i);

	adc->sqr1 = sqr1;
	adc->sqr2 = sqr2;
	adc->sqr3 = sqr3;
}


#endif /* __ASSEMBLER__ */


#endif /* __STM32F_ADC_H__ */
